Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection Methods
The AnalysisSubSection type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis subsection. The analysis subsection identifier must be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisSubSection Class
Tekla.Structures.Analysis Namespace